README.org
#+title: Readme
* Muse
:PROPERTIES:
:ID:       a5b36d98-877c-4d93-a7b2-1eb59069994a
:END:
Search for videos on Youtube, view them, and download their audio tracks.

This package contains an Emacs major mode `muse-mode`, and Rust cli.
** Requirements
:PROPERTIES:
:ID:       4b6a0d83-ccbb-4093-b57b-efca904cf71f
:END:
- `geckodriver`
- `ascii-image-converter`
** Installation
:PROPERTIES:
:ID:       9b8d8950-64d3-4e33-9158-8ce870c1d9f1
:END:
- Install `geckodriver`: `sudo apt install geckodriver`
- Install `ascii-image-converter`: `sudo apt install ascii-image-converter`
- Clone this repo and `cargo install --path .`
- In Emacs, `M-x load-file` and then load `muse.el` in this repo
- `muse-search` and add the query, then press `d` on a video listed in the resulting buffer to download the audio track, `v` to view the video and its related videos in another buffer, `o` to open the video link in the system browser.
** Notes
:PROPERTIES:
:ID:       43b4a4a4-a42a-42ad-9604-f9ec4976610c
:END:
The `muse` cli does not manage the `geckodriver server`, that is responsibility of `muse-mode`. If you want to use the cli independently, start a geckodriver server with `geckodriver --port=4444`.
** Todo
:PROPERTIES:
:ID:       78378491-c6bb-455a-8c71-85114240de74
:END:
- [ ] Refactor `Muse` to hold a `Option<WebDriver>` so that the cli help can be printed
- [ ] Add `Muse` implementations for other sources (Spotify, etc)
- [ ] Stream video to terminal as ascii art
- [ ] Add a more sophisticated `transient` menu to control the download options
- [ ] Add a command to go to the channel for a video, bound to `c`
- [ ] Add tests
